<template>
    <div class="chart-ctn">
        <div ref="echart" class="echart-item-1"></div>
    </div>
</template>
<script setup lang="ts">
import { onMounted, reactive, ref } from 'vue';
import * as echarts from "echarts";

const echart = ref<any>();
let myChart: any = null;

onMounted(() => {
    init();
    window.addEventListener("resize", () => {
        myChart.resize();
    })
});
const init = () => {
    myChart = echarts.init(echart.value);

    let option = {
        title: {
            text: "图表标题"
        },
        tooltip: {
            trigger: 'axis',
            axisPointer: {
                type: 'shadow'
            }
        },
        xAxis: {
            // type: 'category',、
            data: [
                "00:00:00",
                "00:15:00",
                "00:30:00",
                "00:45:00",
                "01:00:00",
                "01:15:00",
                "01:30:00",
                "01:45:00",
                "02:00:00",
                "02:15:00",
                "02:30:00",
                "02:45:00",
                "03:00:00",
                "03:15:00",
                "03:30:00",
                "03:45:00",
                "04:00:00",
                "04:15:00",
                "04:30:00",
                "04:45:00",
                "05:00:00",
                "05:15:00",
                "05:30:00",
                "05:45:00",
                "06:00:00",
                "06:15:00",
                "06:30:00",
                "06:45:00",
                "07:00:00",
                "07:15:00",
                "07:30:00",
                "07:45:00",
                "08:00:00",
                "08:15:00",
                "08:30:00",
                "08:45:00",
                "09:00:00",
                "09:15:00",
                "09:30:00",
                "09:45:00",
                "10:00:00",
                "10:15:00",
                "10:30:00",
                "10:45:00",
                "11:00:00",
                "11:15:00",
                "11:30:00",
                "11:45:00",
                "12:00:00",
                "12:15:00",
                "12:30:00",
                "12:45:00",
                "13:00:00",
                "13:15:00",
                "13:30:00",
                "13:45:00",
                "14:00:00",
                "14:15:00",
                "14:30:00",
                "14:45:00",
                "15:00:00",
                "15:15:00",
                "15:30:00",
                "15:45:00",
                "16:00:00",
                "16:15:00",
                "16:30:00",
                "16:45:00",
                "17:00:00",
                "17:15:00",
                "17:30:00",
                "17:45:00",
                "18:00:00",
                "18:15:00",
                "18:30:00",
                "18:45:00",
                "19:00:00",
                "19:15:00",
                "19:30:00",
                "19:45:00",
                "20:00:00",
                "20:15:00",
                "20:30:00",
                "20:45:00",
                "21:00:00",
                "21:15:00",
                "21:30:00",
                "21:45:00",
                "22:00:00",
                "22:15:00",
                "22:30:00",
                "22:45:00",
                "23:00:00",
                "23:15:00",
                "23:30:00",
                "23:45:00"
            ],
            axisTick: {
                alignWithLabel: true
            },
            axisLabel: {
                rotate: 45, // 旋转角度，正值为顺时针旋转
                fontSize: 10
            }
        },
        yAxis: {
            type: 'value'
        },
        // 在options中加入以下配置即可
        toolbox: {
            show: true,
            feature: {
                magicType: { type: ['line', 'bar'] } //此处最新版本echarts可设置三个值（stack-堆叠模式）,可自行查看echarts文档
            }
        },
        series: [
            {
                data: [
                    1,
                    2,
                    3,
                    4,
                    5,
                    6,
                    7,
                    8,
                    9,
                    10,
                    11,
                    12,
                    13,
                    14,
                    15,
                    16,
                    17,
                    18,
                    19,
                    20,
                    21,
                    22,
                    23,
                    24,
                    25,
                    26,
                    27,
                    28,
                    29,
                    30,
                    31,
                    32,
                    33,
                    34,
                    35,
                    36,
                    37,
                    38,
                    39,
                    40,
                    41,
                    42,
                    43,
                    44,
                    45,
                    46,
                    47,
                    48,
                    49,
                    50,
                    51,
                    52,
                    53,
                    54,
                    55,
                    56,
                    57,
                    58,
                    59,
                    60,
                    61,
                    62,
                    63,
                    64,
                    65,
                    66,
                    67,
                    68,
                    69,
                    70,
                    71,
                    72,
                    73,
                    74,
                    75,
                    76,
                    77,
                    78,
                    79,
                    80,
                    81,
                    82,
                    83,
                    84,
                    85,
                    86,
                    87,
                    88,
                    89,
                    90,
                    91,
                    92,
                    93,
                    94,
                    95,
                    96
                ],
                type: 'line'
            }
        ]
    };
    myChart.setOption(option);
};

</script>
<style lang="less" scoped>
.chart-ctn {
    width: 100%;
    height: 100%;
    display: flex;
    flex-direction: column;
    align-items: center;
    justify-content: center;

    .echart-item-1 {
        width: 80%;
        height: 80%;
        border: 1px solid red;
    }
}
</style>